preconcentrationCE/FASI/FASI_c/0/ampholyte.ARGININE
/*--------------------------------*- C++ -*----------------------------------*\ 
| =========                 |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  v3.0+                                 |
|   \  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
 FoamFile{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      ampholyte.ARGININE;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

 dimensions      [0 -3 0 0 1 0 0];

 internalField  nonuniform List<scalar>
5000
 (
2.4404090200414224e-05
 1.769564331503755e-05
 1.2730514770149962e-05
 9.0861926944972e-06
 6.4336150367416125e-06
 4.519042256093183e-06
 3.148743230722832e-06
 2.1762518165475983e-06
...
)
;

boundaryField
{
    front
    {
        type            wedge;
    }
    back
    {
        type            wedge;
    }
    wall
    {
        type            zeroGradient;
    }
    inlet
    {
        type            inletOutlet;
 inletValue           uniform 0.05;
    phi             flux;
   }
 outlet
    {
        type            inletOutlet;
 inletValue           uniform 0.0;
    phi             flux;
   }

    axis    {
        type            empty;
    }
}
